[
  {
    "@context": "https://schema.org",
    "@type": "LearningResource",
    "name": "Intermediate Research Software Development (Python)",
    "url": "https://carpentries-incubator.github.io/python-intermediate-development/",
    "description": "A core set of established, intermediate-level software development skills and best practices for working as part of a team in a research environment using Python as an example programming language.",
    "learningResourceType": "course",
    "about": "research software development",
    "keywords": "programming language, python, intermediate, software engineering, testing, debugging, version control, continuous integration, packaging code, releasing code, integrated development environment, IDE, virtual environment, git, github, good practices, action, CI/CD, automation, reproducible environment",
    "license": "CC-BY 4.0",
    "creativeWorkStatus": "Published",
    "identifier": "https://doi.org/10.5281/zenodo.6532056",
    "version": "beta-Nov2024",
    "author": "Aleksandra Nenadic, Steve Crouch, Thomas Kile, Raniere Silv, François Michonnea, Maxim Belkin, James Graham, Greg Wilson, Matthew, Toby Hodges, Zhian N. Kamvar, Sven van der Burg, Abby Cabunoc Mayes, JacalynLair, Sarah Stevens, Katrin Leinweber, Erin Becker, João Rodrigues, Douglas Lowe, Sam Mangham, Rayna M Harris, Matthew Blutea, Renato Alv, Sander van Rijn, Rémi Emon, David Mawdsley, Piotr Banaszkiewi, Jemma Stachelek, Giulia Crocion, William L. Close",
    "contributor": "anenadic, steve-crouch, thomaskileyukaea, bielsnohr, jag1g13, tobyhodges, svenvanderburg, JacalynLaird, sstevens2, douglowe, smangham, knarrff, sjvrijn, gcroci2, hsaunders1904, tomneep, unode, danielskatz, amangoel185, wk9874, jreeve-nv, gkmurphy, sverchkov, shartleybham-acuk, gadgil48, olexandr-konovalov, martinjrobins, kzscisoft, k-collie, guyer",
    "audience": "research software engineers",
    "competencyRequired": "Git, Python, Shell",
    "educationalLevel": "beginner",
    "teaches": "Document and structure your software, collaborate to develop, prepare software for others to use.",
    "dateCreated": "2020-04-22T14:47:31Z",
    "dateModified": "2025-07-20T17:42:28Z",
    "provider": "UK's Software Sustainability Institute"
  }
]